Revit 2027 API
RebarConstraint.GetDistanceToTargetHostEdgeCover Method
 Returns the distance from the RebarConstrainedHandle to the target host edge cover. The RebarConstraintType of the RebarConstraint must be 'ToHostEdgeCover'.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double GetDistanceToTargetHostEdgeCover()
Public Function GetDistanceToTargetHostEdgeCover As Double
public:
double GetDistanceToTargetHostEdgeCover()
member GetDistanceToTargetHostEdgeCover : unit -> float
Return Value
Double
 Returns the distance from the RebarConstrainedHandle to the target host edge cover.
Exceptions
Exception | Condition
InvalidOperationException |  RebarConstraint is no longer valid. -or- The RebarConstraint is not of RebarConstraintType 'ToHostEdgeCover'. -or- The RebarConstrainedHandle doesn't allow distance for constraint of ToHostEdge or ToHostEdgeCover type.
See Also
Reference
RebarConstraint Class
Autodesk.Revit.DB.Structure Namespace